{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_29_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_44_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_44_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_27_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_41_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_41_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_25_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_38_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_38_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_35_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_35_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_33_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_33_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_22_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_22_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_34_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_34_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_23_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_23_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_36_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_36_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_24_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_24_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_37_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_37_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_25_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_39_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_39_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_26_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_26_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_40_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_40_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_27_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_42_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_42_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_28_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_28_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_43_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_43_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_29_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/global_average_pooling2d_3_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_5_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_46_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_46_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_6_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_6_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_47_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_47_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_7_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_7_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_35_1/BiasAdd", "op": "_FusedConv2D", "input": ["inputs", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_35_1/convolution/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_35_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-9"}, {"size": "-10"}, {"size": "-11"}, {"size": "-12"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_33_1/BiasAdd", "op": "_FusedConv2D", "input": ["inputs", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_33_1/convolution/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_33_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-9"}, {"size": "-10"}, {"size": "-11"}, {"size": "-12"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_22_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_33_1/BiasAdd", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_22_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_22_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_22_1/batchnorm/mul_1", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_22_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_22_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_22_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_34_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_22_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_34_1/convolution/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_34_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-13"}, {"size": "-14"}, {"size": "-15"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_23_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_34_1/BiasAdd", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_23_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_23_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_23_1/batchnorm/mul_1", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_23_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_11_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_35_1/BiasAdd", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_23_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/max_pooling2d_8_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_11_1/Add"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_23_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/max_pooling2d_8_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_38_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_23_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_38_1/convolution/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_38_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_36_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_23_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_36_1/convolution/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_36_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_24_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_36_1/BiasAdd", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_24_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_24_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_24_1/batchnorm/mul_1", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_24_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_24_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_24_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_37_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_24_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_37_1/convolution/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_37_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_25_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_37_1/BiasAdd", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_25_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_12_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_Add", "op": "AddN", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_38_1/BiasAdd", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_25_1/batchnorm/mul_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_12_1/ArithmeticOptimizer/AddOpsRewrite_Add", "op": "AddV2", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_25_1/batchnorm/sub", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_12_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_Add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/max_pooling2d_9_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_12_1/ArithmeticOptimizer/AddOpsRewrite_Add"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_25_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/max_pooling2d_9_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_41_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_25_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_41_1/convolution/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_41_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-5"}, {"size": "-6"}, {"size": "64"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_39_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_25_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_39_1/convolution/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_39_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-5"}, {"size": "-6"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_26_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_39_1/BiasAdd", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_26_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_26_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_26_1/batchnorm/mul_1", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_26_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_26_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_26_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_40_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_26_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_40_1/convolution/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_40_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-5"}, {"size": "-6"}, {"size": "128"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_27_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_40_1/BiasAdd", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_27_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_13_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_Add", "op": "AddN", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_41_1/BiasAdd", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_27_1/batchnorm/mul_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_13_1/ArithmeticOptimizer/AddOpsRewrite_Add", "op": "AddV2", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_27_1/batchnorm/sub", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_13_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_Add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/max_pooling2d_10_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_13_1/ArithmeticOptimizer/AddOpsRewrite_Add"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_27_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/max_pooling2d_10_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_44_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_27_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_44_1/convolution/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_44_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-7"}, {"size": "-8"}, {"size": "128"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_42_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_27_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_42_1/convolution/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_42_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-7"}, {"size": "-8"}, {"size": "128"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_28_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_42_1/BiasAdd", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_28_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_28_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_28_1/batchnorm/mul_1", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_28_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_28_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_28_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_43_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_28_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_43_1/convolution/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_43_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-7"}, {"size": "-8"}, {"size": "256"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_29_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_43_1/BiasAdd", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_29_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_14_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_Add", "op": "AddN", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_44_1/BiasAdd", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_29_1/batchnorm/mul_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_14_1/ArithmeticOptimizer/AddOpsRewrite_Add", "op": "AddV2", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_29_1/batchnorm/sub", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_14_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_Add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/max_pooling2d_11_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/add_14_1/ArithmeticOptimizer/AddOpsRewrite_Add"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_29_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/max_pooling2d_11_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/global_average_pooling2d_3_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/activation_29_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/global_average_pooling2d_3_1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_5_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/global_average_pooling2d_3_1/Mean", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_5_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "256"}]}, {"dim": [{"size": "256"}, {"size": "256"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_46_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_5_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_46_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_46_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_46_1/batchnorm/mul_1", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_46_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_6_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_46_1/batchnorm/add_1", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_6_1/Cast/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_6_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "256"}]}, {"dim": [{"size": "256"}, {"size": "128"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_47_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_6_1/Relu", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_47_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_47_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_47_1/batchnorm/mul_1", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_47_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_7_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/batch_normalization_47_1/batchnorm/add_1", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_7_1/Cast/ReadVariableOp", "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_7_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}]}, {"dim": [{"size": "128"}, {"size": "3"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_7_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_7_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/lymphoma_model_1/functional_3_1/dense_7_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_29_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_44_1/convolution/ReadVariableOp", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_44_1/Squeeze", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_27_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_41_1/convolution/ReadVariableOp", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_41_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_25_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_38_1/convolution/ReadVariableOp", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_38_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_35_1/convolution/ReadVariableOp", "shape": [1, 1, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_35_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_33_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_33_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_22_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_22_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_34_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_34_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_23_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_23_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_36_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/conv2d_36_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_24_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/lymphoma_model_1/functional_3_1/multissl_encoder_1/batch_normalization_24_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": 